Classes | Public Types | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::Library::GSMObject Class Referencefinal
Library Management
GSMObject is the representation of a loaded .gsm file. More...
#include <GSMObject.hpp>
 Inheritance diagram for ACAPI::Library::GSMObject:
 Classes
class  | Modifier
The modifier object of the GSMObject. More...
 Public Types
enum class  | CopyMethod { CopyMethod::GenerateNewUnID , CopyMethod::KeepMainGuid }
Control flags for the copy of the GSM objects. More...
 Public Member Functions
ACAPI::Result< void >  | CopyTo (const IO::Location &fileLocation, CopyMethod method=CopyMethod::KeepMainGuid)
Creates a new copy from the GSM file to a location.
ACAPI::Result< void >  | Modify (const std::function< GSErrCode(Modifier &)> &modifierFunc, GS::UniString password=GS::EmptyUniString)
Opens a modification scope if the object is editable. See 'IsEditable'.
bool  | IsEditable () const
A GSM file is editable if it is loaded from the local file system. GSM files from Loaded Libraries should be copied into a local directory before editing.
ACAPI::Result< GS::UnID >  | GetUnID () const
The UnID is a combination of the main guid and the revision guid.
ACAPI::Result< bool >  | IsPlaceable () const
The object can be placed in a plan file.
ACAPI::Result< bool >  | IsPasswordProtected () const
The object is password protected and encrypted.
ACAPI::Result< GS::UnID >  | GetSubTypeUnID () const
The UnID of the object's direct ancestor in the subtype hierarchy.
ACAPI::Result< bool >  | IsSubType () const
The object is an 'object subtype'.
ACAPI::Result< bool >  | IsInSubTypeOf (const GS::UnID &subTypeID) const
The object is a subtype of the given UnID.
bool  | HasMasterScript () const
Checks whether MasterScript has value or is empty.
bool  | Has2DScript () const
Checks whether 2DScript section has value or is empty.
bool  | Has3DScript () const
Checks whether 3DScript section has value or is empty.
bool  | HasPropertiesScript () const
Checks whether PropertiesScript section has value or is empty.
bool  | HasParameterScript () const
Checks whether ParameterScript section has value or is empty.
bool  | HasInterfaceScript () const
Checks whether InterfaceScript section has value or is empty.
bool  | HasForwardMigrationScript () const
Checks whether ForwardMigrationScript section has value or is empty.
bool  | HasBackwardMigrationScript () const
Checks whether BackwardMigrationScript section has value or is empty.
bool  | Has2DVectorImage () const
Checks whether 2DVectorImage section has value or is empty.
bool  | HasPreviewPicture () const
Checks whether PreviewPicture section has value or is empty.
bool  | HasDarkPreviewPicture () const
Checks whether DarkPreviewPicture section has value or is empty.
bool  | HasGDLPictures () const
Checks whether GDLPictures section has value or is empty.
bool  | HasDarkGDLPictures () const
Checks whether DarkGDLPictures section has value or is empty.
bool  | HasCustomSection (uint32_t sectionTypeID, uint16_t index) const
Checks whether CustomSection has value or is empty.
ACAPI::Result< GS::UniString >  | GetAuthor () const
Author of the object.
ACAPI::Result< GS::UniString >  | GetLicense () const
License name of the object.
ACAPI::Result< GS::UniString >  | GetLicenseVersion () const
License version of the object.
ACAPI::Result< GS::UniString >  | GetDescription () const
Description of the object.
ACAPI::Result< GS::UniString >  | GetKeywords () const
Keywords of the object. Mostly used for search. Usually it is a comma separated list.
ACAPI::Result< GDL::Parameters >  | GetParameters () const
Parameter list of the object.
ACAPI::Result< std::vector< GS::UniString > >  | GetParameterDescriptions () const
Parameter descriptions of the object.
ACAPI::Result< GS::UniString >  | GetMasterScript (const GS::UniString &password=GS::EmptyUniString) const
Master script of the object.
ACAPI::Result< GS::UniString >  | Get2DScript (const GS::UniString &password=GS::EmptyUniString) const
2D script of the object.
ACAPI::Result< GS::UniString >  | Get3DScript (const GS::UniString &password=GS::EmptyUniString) const
3D script of the object.
ACAPI::Result< GS::UniString >  | GetPropertiesScript (const GS::UniString &password=GS::EmptyUniString) const
Properties script of the object.
ACAPI::Result< GS::UniString >  | GetParameterScript (const GS::UniString &password=GS::EmptyUniString) const
Parameter script of the object.
ACAPI::Result< GS::UniString >  | GetInterfaceScript (const GS::UniString &password=GS::EmptyUniString) const
Interface script of the object.
ACAPI::Result< bool >  | IsUIDefault () const
The defined interface is set as default UI.
ACAPI::Result< bool >  | IsHierarchicalPagesUsed () const
The defined interface uses hierarchical pages.
ACAPI::Result< GS::UniString >  | GetForwardMigrationScript (const GS::UniString &password=GS::EmptyUniString) const
Forward Migration script of the object.
ACAPI::Result< GS::UniString >  | GetBackwardMigrationScript (const GS::UniString &password=GS::EmptyUniString) const
Backward Migration script of the object.
ACAPI::Result< VectorImage >  | Get2DVectorImage () const
2D Vector Image of the object.
ACAPI::Result< GX::ImageRef >  | GetPreviewPicture () const
Preview picture of the object.
ACAPI::Result< GX::ImageRef >  | GetDarkPreviewPicture () const
Dark mode Preview picture of the object.
ACAPI::Result< std::vector< GX::ImageRef > >  | GetGDLPictures () const
Embedded pictures of the object.
ACAPI::Result< std::vector< GX::ImageRef > >  | GetDarkGDLPictures () const
Dark mode embedded pictures of the object.
ACAPI::Result< GSMSectionData >  | GetCustomSection (uint32_t sectionID, uint16_t index=0) const
Custom section data of the object.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static ACAPI::Result< GSMObject >  | CreateNew (const IO::Location &fileLocation, const ACAPI::Library::GSMObject &ancestorSubType)
Creates a new empty GSM Object.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
GSMObject is the representation of a loaded .gsm file.
A GSMObject can represent a .gsm file which is loaded from the local file system or loaded from a library. Only GSM objects loaded from file can be modified.
Since
Archicad 28